<?php
/**
 * Created by PhpStorm.
 * User: wangyupeng
 * Date: 2017/8/29
 * Time: 上午11:32
 */

require_once 'Trie.php';
require_once 'ac.php';

$post_data = array('content' => '1、首先着重说明的一点：我可以办内部退休，人就完全自由了，基本生活费也就有了可靠的保障！可以去任何地方，同样可以去你所在的地方生活并开创新的伟大事业！2、我们也许都是具有现代独立人格独立精神的人，我有想法就实话对你实说吧，我觉得你很有可能是一位正派、端庄、秀丽、感情细腻又深藏感情、爱学习的中年女性！你渴望人间真爱，但又无法完全脱俗，你和你家长都会考虑选择伴侣在考虑人品、学识、修养、相貌的同时，还要考虑年龄、地域、经济收入等等物质条件的，我完全能够理解和同情！然而，现实生活难以获得理想中的完美，也许只有侧重两者的一个方面才会获得真实可靠的爱人，我的看法仅仅供你参考！我想，你不会反感我，也有可能对我有相当的好感和兴趣，但鉴于我年龄比你大很多岁，不在像北京市上海市等等等等这样的大城市居住，也不在发达的国外移民定居，收入低，离异并有女儿，你可能是难以接纳我的，我对你深表理解同情，对我自己深感遗憾……我觉得实际上，事物还有另一种看法，这就是同一个事物的两个方面，有的人虽然是青年，但身体健康状况却不如老年，为什么呢？因为青年人往往不懂得不会重视养生保健，老年人经历过失去健康的刻骨铭心的痛苦后，会发奋弥补养生保健的缺失，身体逐渐强壮起来，例如我84岁的爸爸，他老人家人到中年时，身体患上了很多医院都治不好的疾病，通过自己的养生保健系列做法和运动，连一辈子需要服药的高血压都治好了，在完全不吃药的情况下，“三高”无数次化验均正常，读书看报创作诗词作画书法，用手在纸上写作长篇文章不需要戴老花镜，吹箫、吹口琴优美的乐曲声，他自己听得特别清楚，还能及时矫正演吹得不准确的地方呢！白头发变黑了，掉头发不掉了，步行上11楼只需要2.5分钟，不停歇不气喘，不到40岁时满口牙齿松动摇晃，84岁了，却保健得固若金汤，稳如泰山，能轻松地吃带硬皮的核桃、炒黄豆、w蚕豆呢，青年人都达不到这样的健康水平啊！！！我爸爸创造了生命返老还青的绝妙奇迹！2014年12月，天水市电视台、《天水晚报》来采访的20岁出头的新闻青年女记者非常惊奇佩服！而我们身边又有多少青年中年人因为没有健康意识、没有顽强的意志力、没有美德，过早的残疾和夭折了啊！不久前，我熟悉的一位38岁的过去的大壮小伙子高血压中风离世了。试想，吃喝嫖赌毒五毒俱全的人，也就是没有或缺乏个人修养和素质的人，即使是青年人，也不如老年人好！这就是人生和生活的哲学辩证法啊！我有生以来，与你这样的中年女性通信这么多这么深刻地写了一大堆还是第一次，我很珍视，也希望你能够珍视！假如，我做不了你的爱人，我愿做你人生航行的灯塔——当然必须是你觉得我拥有那样的睿智光芒！假如，我不配作你的爱人，那么，当你在茫茫人海中找到了你的意中人的话，别忘了在中国最大的恋爱网站——“世纪佳缘”上认识的我，因为我有宽广的大海一样的胸怀，我绝对不会嫉妒我的“情敌”——你的爱人！正因为我具备现当代人的独立人格和优秀个性，才愿意在你找到你爱的人的那个幸福的时候，我愿意最真诚地为你送去最浓浓的永生不忘的祝福！！！3、你愿意与世界华人少年画家第一人、天水市美德少年、我女儿熊珊交友吗？假如愿意，告诉我，我助你！4、刚才又看了你的生活方式，我很赞同！我特别注意锻炼身体，社交场合不喝酒，我用别人看电视的20年时间，刻苦自学中医药学，特别懂得养生保健，治愈了家里亲属很多医院治不好的病，假如用我的学识用于美容保健，收获很乐观——这是我女儿的感叹啊！5、我很赞同你的个人的独立和开朗！但你没谈爱情观，你相信吗，人世间是有真爱的，我在这方面也有研究，写过大量文章，足可以出著作！这取决于双方的素质和美好心灵！——我在呼唤你啊！6、我觉得你对我还是有些了解了吧，我年龄比你大许多岁，我首先要求我自己绝对尊重你的感情和自由选择爱人！这种对你的尊重是我个人素质的自然使然！其实，历史上至今天，有很多忘年恋极为成功的例子，例如我们大家最熟悉的我国最杰出的数学家陈景润比他爱人年长20多岁！孙中山的夫人是自己同辈朋友的女儿，比孙中山年龄小30多岁呢，再如鲁迅先生和他的学生徐广萍，师生之间年龄也很悬殊……我觉得相恋——人品是第一位的，我对人品有两个核心定义，一是指品德善良正义感，二是个人修养素质与才能……这些我个人都具备，我是集作家，美术家、教育家于一身，阅历极其丰富，生活体会极其深刻……，时间关系，一言难尽，想与你交友，以后慢慢相互了解，即使成为不了爱人，总可以成为知心忘年朋友吧——我对青少年和比我年龄小的中年人没有任何长辈和文化名人的架子，特别提倡和力行平等与民主，与我交谈生活与艺术是非常愉悦的享受啊，我觉得对你既然信任，觉得你好，说话就没什么好躲闪的！热切盼望你的回信！哪怕是不愿意我再次与你联系也行！我喜欢表达心意直爽又有礼貌啊！7、你的择偶条件，我符合，愿意与我进一步相互了解吗？说实话，我也不是等闲之辈，我是一名十分难遇的高素质与个性修养的人，因为我是一名真正的学习型的人物，并且经历了几十年的各种艰难困苦的磨难锻炼，你还记得世界文学巨匠但丁的不朽名著《神曲》吗？这部名著阐述了这样一个真理：人类必须经历“炼狱阶段”才能到达“天堂”的境界！另一位世界文学巨匠巴尔扎克指出：苦难是造就杰出艺术家和杰出人物的最好学校！再一位世界文学巨匠歌德花费60年心血写的《浮士德》也阐释了这同一真理！我就是这一真理实践过来的人！年龄小的人是不可能拥有这笔看不见的精神财富的！我在各个学科领域的实践中创造了很多奇迹，例如医疗与保青春、家庭教育、历史学、文学、影视艺术……未有时间修改整理的完全靠手写的著作多达500多万字！内容包括人生问题的方方面面……全中国300多家新闻等媒体报道，未来将会在生意场上有所作为，甚至完全可能大有作为！不要错过我们相识的机遇，你完全可以了解我的认真执着与难得的真诚！你还犹豫什么呢？！8、你要是与我结合，你的孩子将得到我对你的孩子特别好的家庭教育！“俗物和天才”的形成与巨大差异是教育的结果！而不是所谓天赋！另外，我完全可以请长假或者提前内退休前往你所居住和工作的地方与你共同把事业干大！你要相信我的才干和人品，你可以上网用360搜索“天水熊珊熊建林”，全中国300多家新闻等媒体报道！还有，我女儿熊珊今年18岁，她在我的教育下极具现代文明意识，一定会与你相处得很好的！我这样的条件和素质，你是很难找到的，我是极具个人人格魅力的！热切盼望你看信后回信！！！');

//$handle = fopen('dict.txt', 'r');
//
//$trie = new TrieTree();
//
//while (!feof($handle)) {
//    $word = rtrim(fgets($handle));
//
//    if (!empty($word)) {
//        $trie->insert($word);
//    }
//}
//
//
//$start = microtime(true);
//$res = $trie->contain($post_data['content']);
//$end = microtime(true);
//var_dump($res);
//
//var_dump($end - $start);
//
//echo (memory_get_peak_usage() / 1024 / 1024) . 'M';
//

$handle = fopen('dict.txt', 'r');

$trie = new Trie();

while (!feof($handle)) {
    $word = rtrim(fgets($handle));

    if (!empty($word)) {
        $trie->insert($word);
    }
}

$start = microtime(true);
$res = $trie->search_all($post_data['content']);
$end = microtime(true);
var_dump($res);

var_dump($end - $start);

echo (memory_get_peak_usage() / 1024 / 1024) . 'M';

//
//$url = "http://127.0.0.1:9502";
//$ch = curl_init();
//
//curl_setopt($ch, CURLOPT_URL, $url);
//curl_setopt($ch, CURLOPT_RETURNTRANSFER, 1);
//// post数据
//curl_setopt($ch, CURLOPT_POST, 1);
//// post的变量
//curl_setopt($ch, CURLOPT_POSTFIELDS, $post_data);
//
//$output = curl_exec($ch);
//
////var_dump(curl_getinfo($ch));
//curl_close($ch);
//
////打印获得的数据
//print_r($output);
